app/controllers/account_activations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test4@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "activated" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["activated", 1], ["updated_at", "2019-06-27 12:09:46.896340"], ["id", 115]]
UPDATE "users" SET "updated_at" = ?, "activated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2019-06-27 12:09:46.902454"], ["activated_at", "2019-06-27 12:09:46.902060"], ["id", 115]]
---
	def edit
		@user = User.find_by(email: params[:email])
		if @user && !@user.activated?&& @user.authenticated?(:activation, params[:id])
		   @user.update_attribute(:activated, true)
		   @user.update_attribute(:activated_at, Time.zone.now)