app/controllers/microposts_controller.rb

	def index
		@microposts = Micropost.paginate(page: params[:page], per_page: 20).order(created_at: :desc)
---
SELECT  "microposts".* FROM "microposts" ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 100]]
SELECT COUNT(*) FROM "microposts"

	def create
		micropost = current_user.microposts.create(content: params[:micropost][:content])
---
INSERT INTO "microposts" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 117], ["content", "dasdasdasd"], ["created_at", "2019-07-01 13:55:22.232457"], ["updated_at", "2019-07-01 13:55:22.232457"]]

	def destroy
		@micropost = Micropost.find(params[:id])
		@micropost.destroy
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 207], ["LIMIT", 1]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 207]]