app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$ZYFWdEESnMkFsXPtwcB0/uyVQTYvQ6WqB3dpu23xzwa0skVT1/vvu"], ["updated_at", "2019-06-27 13:27:37.672505"], ["id", 117]]
---
  def update
  	if @user.password_reset_expired?
  		flash[:danger] = "Password resets has expired"
  		redirect_to new_password_reset_url
  	elsif params[:user][:password].empty?
  		@user.errors.add(:password, "can't be empty")
  		render 'edit'
  	elsif @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test6@gmail.com"], ["LIMIT", 1]]
---
  def set_user
  	@user = User.find_by email: params[:email]