app/controllers/relationships_controller.rb

  def create
  	@user = User.find params[:followed_id]
  	current_user.active_relationships.create! followed_id: @user.id
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 117], ["followed_id", 6], ["created_at", "2019-07-02 13:24:27.503104"], ["updated_at", "2019-07-02 13:24:27.503104"]]

  def destroy
  	@user = Relationship.find(params[:id]).followed
  	current_user.active_relationships.find_by(followed_id: @user.id).destroy
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 27]]