app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 10)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"